In [9]:
import pandas as pd
data ={'이름' : ['강감찬', '을지문덕', '이순신', '권율'],
       '학교' : ['A고', 'B고', 'C고', 'D고'],
       '국어' : [100,95,100,85],
       '영어' : [85,75,90,100],
       '수학' : [100,75,95,85.0]}
df1 = pd.DataFrame(data)
df1
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   학교      4 non-null      object
 2   국어      4 non-null      int64
 3   영어      4 non-null      int64
 4   수학      4 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 292.0+ bytes

In [10]:
df2 = df1[["이름", '국어']]
df2

     이름   국어
0   강감찬  100
1  을지문덕   95
2   이순신  100
3    권율   85

In [11]:
df2 = pd.DataFrame(data, index='1번 2번 3번 4번'.split())
df2

      이름  학교   국어   영어     수학
1번   강감찬  A고  100   85  100.0
2번  을지문덕  B고   95   75   75.0
3번   이순신  C고  100   90   95.0
4번    권율  D고   85  100   85.0

In [12]:
df2['국어'].mean()

np.float64(95.0)

In [13]:
df2['국어'].sum()

np.int64(380)

In [14]:
df2['수학'].median()

np.float64(90.0)

In [17]:
df = pd.DataFrame(data)
df.index.name='학번'
df

      이름  학교   국어   영어     수학
학번
0    강감찬  A고  100   85  100.0
1   을지문덕  B고   95   75   75.0
2    이순신  C고  100   90   95.0
3     권율  D고   85  100   85.0

In [18]:
df.reset_index()

   학번    이름  학교   국어   영어     수학
0   0   강감찬  A고  100   85  100.0
1   1  을지문덕  B고   95   75   75.0
2   2   이순신  C고  100   90   95.0
3   3    권율  D고   85  100   85.0

In [19]:
df2.index.name='학번'
df2

      이름  학교   국어   영어     수학
학번
1번   강감찬  A고  100   85  100.0
2번  을지문덕  B고   95   75   75.0
3번   이순신  C고  100   90   95.0
4번    권율  D고   85  100   85.0

In [20]:
df.reset_index()

   학번    이름  학교   국어   영어     수학
0   0   강감찬  A고  100   85  100.0
1   1  을지문덕  B고   95   75   75.0
2   2   이순신  C고  100   90   95.0
3   3    권율  D고   85  100   85.0

In [21]:
df2.reset_index()
df2

      이름  학교   국어   영어     수학
학번
1번   강감찬  A고  100   85  100.0
2번  을지문덕  B고   95   75   75.0
3번   이순신  C고  100   90   95.0
4번    권율  D고   85  100   85.0

In [22]:
df2

      이름  학교   국어   영어     수학
학번
1번   강감찬  A고  100   85  100.0
2번  을지문덕  B고   95   75   75.0
3번   이순신  C고  100   90   95.0
4번    권율  D고   85  100   85.0

In [23]:
df2.reset_index()

   학번    이름  학교   국어   영어     수학
0  1번   강감찬  A고  100   85  100.0
1  2번  을지문덕  B고   95   75   75.0
2  3번   이순신  C고  100   90   95.0
3  4번    권율  D고   85  100   85.0

In [24]:
df.to_excel('sungjuk.xlsx')

In [25]:
dfExcel = pd.read_excel('sungjuk.xlsx')

In [26]:
dfExcel

   학번    이름  학교   국어   영어   수학
0   0   강감찬  A고  100   85  100
1   1  을지문덕  B고   95   75   75
2   2   이순신  C고  100   90   95
3   3    권율  D고   85  100   85

In [29]:
dfExcel["국어"] > 90

0     True
1     True
2     True
3    False
Name: 국어, dtype: bool

In [30]:
dfExcel["국어"] * 90

0    9000
1    8550
2    9000
3    7650
Name: 국어, dtype: int64

In [33]:
dfExcel.transpose()

      0     1    2    3
학번    0     1    2    3
이름  강감찬  을지문덕  이순신   권율
학교   A고    B고   C고   D고
국어  100    95  100   85
영어   85    75   90  100
수학  100    75   95   85

In [34]:
dfExcel.loc("학번")['1번','2번','3번','4번']

ValueError: No axis named 학번 for object type DataFrame

In [ ]:
df2